// 中间界面数据
module.exports = {
  'GET /api/centerPageData': {
    detailsList: [
      {
        title: '项目开发人数',
        number: '10 人',
        // unit: '人',
      },
      {
        // title: '工时',
        number: '计划工时：330 时',
        number2: '已完成：100 时',
        number3: '未完成：230 时',
        // unit: '小时',
      },
      {
        // title: '任务数',
        number: '总任务：50 个',
        number2: '已完成：20 个',
        number3: '未完成：30 个',
        // unit: '个',
      },
      {
        // title: 'Bug数',
        number: '总Bug：100 个',
        number2: '待回归：50 个',
        number3: '未完成：20 个',
        // unit: '个',
      },
    ],
    mapData: {
      moveLines: [
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '山东',
          toName: '南京',
          coords: [
            [117.020359, 36.66853],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '北京',
          toName: '南京',
          coords: [
            [116.407526, 39.90403],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '天津',
          toName: '南京',
          coords: [
            [117.200983, 39.084158],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '河北',
          toName: '南京',
          coords: [
            [114.475704, 38.584854],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '天津',
          toName: '南京',
          coords: [
            [117.200983, 39.084158],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '内蒙古',
          toName: '南京',
          coords: [
            [111.765618, 40.817498],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '内蒙古',
          toName: '南京',
          coords: [
            [111.765618, 40.817498],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '四川',
          toName: '南京',
          coords: [
            [104.075931, 30.651652],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '内蒙古',
          toName: '南京',
          coords: [
            [111.765618, 40.817498],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '山西',
          toName: '南京',
          coords: [
            [112.562398, 37.873532],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '上海',
          toName: '南京',
          coords: [
            [121.473701, 31.230416],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '四川',
          toName: '南京',
          coords: [
            [104.075931, 30.651652],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '河北',
          toName: '南京',
          coords: [
            [114.475704, 38.584854],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '内蒙古',
          toName: '南京',
          coords: [
            [111.765618, 40.817498],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '安徽',
          toName: '南京',
          coords: [
            [117.284923, 31.861184],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京浩特',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '广西',
          toName: '南京',
          coords: [
            [108.327546, 22.815478],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '内蒙古',
          toName: '南京',
          coords: [
            [111.765618, 40.817498],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '山东',
          toName: '南京滨',
          coords: [
            [117.020359, 36.66853],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '四川',
          toName: '南京',
          coords: [
            [104.075931, 30.651652],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '河北',
          toName: '南京',
          coords: [
            [114.475704, 38.584854],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '山东',
          toName: '南京',
          coords: [
            [117.020359, 36.66853],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京庄',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '湖北',
          toName: '南京',
          coords: [
            [114.341862, 30.546498],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '内蒙古',
          toName: '南京',
          coords: [
            [111.765618, 40.817498],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京玛依',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京门外东大街',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '山东',
          toName: '南京',
          coords: [
            [117.020359, 36.66853],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '内蒙古',
          toName: '南京',
          coords: [
            [111.765618, 40.817498],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '西藏',
          toName: '南京',
          coords: [
            [91.117212, 29.646923],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '河北',
          toName: '南京',
          coords: [
            [114.475704, 38.584854],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '黑龙江',
          toName: '南京',
          coords: [
            [126.661669, 45.742347],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '河北',
          toName: '南京',
          coords: [
            [114.475704, 38.584854],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京港',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '辽宁',
          toName: '南京',
          coords: [
            [123.42944, 41.835441],
            [118.796877, 32.060255],
          ],
        },
        {
          fromName: '吉林',
          toName: '南京',
          coords: [
            [126.549572, 43.837883],
            [118.796877, 32.060255],
          ],
        },
      ],
    },
  },
};
